/*
Στη δομή σύνθετης επιλογής, αν ισχύει η συνθήκη, τότε εκτελείται το block των εντολών εντός των '{...}' μετά τη συνθήκη.
Σε διαφορετική περίπτωση (αν η συνθήκη δεν ισχύει) εκτελείται το block των εντολών εντός των '{...}' μετά το else.
Σε κάθε περίπτωση, εκτελείται πάντα ένα block εντολών εντός των '{...}'.


Παράδειγμα:
Διαβάζεται ένας αριθμός (integer) από το πληκτρολόγιο. Αν ο αριθμός που διαβάστηκε είναι μεγαλύτερος του μηδενός τότε να
εμφανίζει στην οθόνη το μήνυμα "Θετικός αριθμός" αλλιως να εμφανίζεται το μήνυμα "όχι θετικός".
*/


#include <iostream>
using namespace std;

int main ()
    {
    int x;    //Variable Declaration
    cout << "Enter number: ";
    cin >> x;
    if (x > 0)  //Condition: x>0
        {
        cout << "possitive number\n";
        }
    else        //Condition: x<=0
        {
        cout << "not positive\n";
        }
    cout << "Good night\n";
    return 0;
    }
